## Plan Result (prod_app_registrations)




<pre><code>Plan: 5 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.this.azuread_application.this[&#34;DTS HMCTS way indexer&#34;]
  * module.this.azuread_application_federated_identity_credential.this[&#34;DTS HMCTS way indexer-repo:hmcts/hmcts.github.io:pull_request&#34;]
  * module.this.azuread_application_federated_identity_credential.this[&#34;DTS HMCTS way indexer-repo:hmcts/hmcts.github.io:ref:refs/heads/master&#34;]
  * module.this.azuread_application_federated_identity_credential.this[&#34;DTS HMCTS way indexer-repo:hmcts/hmcts.github.io:ref:refs/heads/source&#34;]
  * module.this.azuread_service_principal.this[&#34;DTS HMCTS way indexer&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.this.azuread_application.this["DTS HMCTS way indexer"] will be created
  + resource "azuread_application" "this" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "DTS HMCTS way indexer"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "dad693c4-36ad-468f-94e9-76faa4bc844b",
        ]
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }
    }

  # module.this.azuread_application_federated_identity_credential.this["DTS HMCTS way indexer-repo:hmcts/hmcts.github.io:pull_request"] will be created
  + resource "azuread_application_federated_identity_credential" "this" {
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + display_name          = "repo_hmcts__hmcts.github.io_pull_request"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:hmcts/hmcts.github.io:pull_request"
    }

  # module.this.azuread_application_federated_identity_credential.this["DTS HMCTS way indexer-repo:hmcts/hmcts.github.io:ref:refs/heads/master"] will be created
  + resource "azuread_application_federated_identity_credential" "this" {
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + display_name          = "repo_hmcts__hmcts.github.io_ref_refs__heads__master"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:hmcts/hmcts.github.io:ref:refs/heads/master"
    }

  # module.this.azuread_application_federated_identity_credential.this["DTS HMCTS way indexer-repo:hmcts/hmcts.github.io:ref:refs/heads/source"] will be created
  + resource "azuread_application_federated_identity_credential" "this" {
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + display_name          = "repo_hmcts__hmcts.github.io_ref_refs__heads__source"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:hmcts/hmcts.github.io:ref:refs/heads/source"
    }

  # module.this.azuread_service_principal.this["DTS HMCTS way indexer"] will be created
  + resource "azuread_service_principal" "this" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_id              = (known after apply)
      + application_tenant_id       = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "dad693c4-36ad-468f-94e9-76faa4bc844b",
        ]
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }

      + features {
          + custom_single_sign_on_app = (known after apply)
          + enterprise_application    = (known after apply)
          + gallery_application       = (known after apply)
          + visible_to_users          = (known after apply)
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ app_registrations = {
      + "DTS HMCTS way indexer"           = {
          + application_id    = (known after apply)
          + display_name      = "DTS HMCTS way indexer"
          + id                = (known after apply)
          + object_id         = (known after apply)
          + owners            = [
              + "dad693c4-36ad-468f-94e9-76faa4bc844b",
            ]
          + publisher_domain  = (known after apply)
          + service_principal = {
              + application_id        = (known after apply)
              + application_tenant_id = (known after apply)
              + id                    = (known after apply)
              + object_id             = (known after apply)
            }
        }
        # (9 unchanged elements hidden)
    }
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.this.azuread_application.this["darts-portal-v2"] has changed
  ~ resource "azuread_application" "this" {
      + group_membership_claims        = []
        id                             = "78e19e28-a66e-4ae0-9db6-9b861d749233"
      + identifier_uris                = []
        tags                           = []
        # (13 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.this.azuread_service_principal.this["darts-portal-v2"] has changed
  ~ resource "azuread_service_principal" "this" {
      + alternative_names            = []
        id                           = "e2e12b18-0601-4740-baae-4dbf439530e3"
      + notification_email_addresses = []
        tags                         = []
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":63,"Program":"tfcmt","SHA1":"","Target":"prod_app_registrations","Vars":{}} -->